Revit 2026 API

# LoadCombinationState Enumeration

---

Specifies load combination state.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadCombinationState
```
```vb
Public Enumeration LoadCombinationState
```
```cpp
public enum class LoadCombinationState
```
```fsharp
type LoadCombinationState
```

| Member name | Value | Description |
| --- | --- | --- |
| Accidental | 5 | Accidental |
| Serviceability | 0 | Serviceability |
| ServiceabilityFrequent | 3 | Serviceability Frequent |
| ServiceabilityQuasiPermanent | 2 | Serviceability Quasi-permanent |
| ServiceabilityRare | 4 | Serviceability Rare |
| Special | 6 | Special |
| Ultimate | 1 | Ultimate |

#### Reference

Autodesk.Revit.DB.Structure Namespace